/* Copyright distributed.net 1997-1999 - All Rights Reserved
 * For use in distributed.net projects only.
 * Any other distribution or use of this source violates copyright.
 *
 * Win32/Win16 Screen Saver stuff.
 * Written by Cyrus Patel <cyp@fb14.uni-mainz.de>
*/

const char *w32ss_cpp(void) {
return "@(#)$Id: w32ss.cpp,v 1.1.2.5 2001/05/14 15:24:38 cyp Exp $"; }

#include "cputypes.h"
#define INCLUDE_COMMDLG_H
#define INCLUDE_SHELLAPI_H
#define INCLUDE_VER_H
#include <windows.h>
#include <commdlg.h>
#include "w32util.h" /* int (PASCAL *__SSMAIN)(HINSTANCE,HINSTANCE,LPSTR,int);*/
#include "w32ini.h"  /* [Get|Write]DCTIProfile[String|Int]() */
#include "w32cons.h" /* W32CLI_CONSOLE_NAME, W32CLI_MUTEX_NAME */
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#if !defined(MAX_PATH)           //win16
#define MAX_PATH 256
#endif
#ifndef GWL_HINSTANCE            //win16
#define GWL_HINSTANCE (-6)
#endif

#ifndef SM_CMONITORS
#define SM_XVIRTUALSCREEN       76
#define SM_YVIRTUALSCREEN       77
#define SM_CXVIRTUALSCREEN      78
#define SM_CYVIRTUALSCREEN      79
#define SM_CMONITORS            80
#define SM_SAMEDISPLAYFORMAT    81
#endif

/* ---------------------------------------------------- */
    
static const char *szSSIniSect = "ScreenSaver";
static const char *szAppName = "distributed.net client launcher";
static char szAlternateAppName[64] = {0};

#define SSWriteProfileString(e,v) WriteDCTIProfileString(szSSIniSect,e,v)
#define SSGetProfileString(e,d,b,l) GetDCTIProfileString(szSSIniSect,e,d,b,l)
#define SSWriteProfileInt(e,v)    WriteDCTIProfileInt(szSSIniSect,e,v)
#define SSGetProfileInt(e,d)        GetDCTIProfileInt(szSSIniSect,e,d)

/* ---------------------------------------------------- */

static int SSIsTransparencyAvailable(void)
{
  static int iswin95 = -1;
  if (iswin95 == -1)
    iswin95 = (winGetVersion()>=400 && winGetVersion()<2000)?(+1):(0);
  return iswin95;
}  

/* ---------------------------------------------------- */

static int SSChangePassword(HINSTANCE hInst, HWND hwnd)
{
  hInst = hInst;
  #if (CLIENT_OS != OS_WIN32)
  hwnd = hwnd;
  #else
  HINSTANCE hmpr = LoadLibrary("MPR.DLL");
  if (hmpr != NULL) 
  {
    typedef VOID (WINAPI *PWDCHANGEPASSWORD)
          (LPCSTR lpcRegkeyname,HWND hwnd,UINT uiReserved1,UINT uiReserved2);
    PWDCHANGEPASSWORD PwdChangePassword=
      (PWDCHANGEPASSWORD)GetProcAddress(hmpr, "PwdChangePasswordA" );
    if (PwdChangePassword != NULL)
      PwdChangePassword( "SCRSAVE", hwnd, 0,0 );
    FreeLibrary(hmpr);
  }
  #endif
  return 0;
}                                

/* ---------------------------------------------------- */

static LRESULT CALLBACK SaverWindowProc(HWND hwnd,UINT msg,WPARAM wParam,LPARAM lParam)
{ 
  static struct 
  {
    HWND hParentWnd;
    POINT initCursorPos;
    DWORD initTime;
    int isDialogActive;
    int reallyClose;
    int sstype; /* 0 == blank, -1 == none */
    UINT top, left, height, width;
    int mmthreshX, mmthreshY;
  } ss = {0,{0,0},0,0,0,0,0,0,0,0};
  
  switch (msg)
  { 
    case WM_CREATE:
    { 
      RECT rc;
      GetCursorPos(&(ss.initCursorPos)); 
      ss.initTime = GetTickCount();
      GetWindowRect(hwnd, &rc);
      ss.top = rc.top;
      ss.left = rc.left;
      ss.height = (UINT)(rc.bottom - rc.top);
      ss.width = (UINT)(rc.right - rc.left);
      ss.hParentWnd = GetParent(hwnd);
      if (ss.hParentWnd && GetDesktopWindow() == ss.hParentWnd)
        ss.hParentWnd = NULL;
      ss.mmthreshX = ss.mmthreshY = 4;
      #if defined(SM_CXDRAG) && defined(SM_CYDRAG)
      ss.mmthreshX = GetSystemMetrics(SM_CXDRAG); /* generally 2x2 */
      ss.mmthreshY = GetSystemMetrics(SM_CYDRAG);
      #endif
      if (!SSIsTransparencyAvailable())
        ss.sstype = 0;
      else if ((ss.sstype = SSGetProfileInt( "type", 0 )) != -1)
        ss.sstype = 0;
      else if (!ss.hParentWnd && (ss.width > (UINT)GetSystemMetrics(SM_CXSCREEN) ||
                                 ss.height > (UINT)GetSystemMetrics(SM_CYSCREEN)) )
      { /* compensate for multi-monitor */
        GetWindowRect(GetDesktopWindow(), &rc);
        ss.top = rc.top;
        ss.left = rc.left;
        ss.height = (UINT)(rc.bottom - rc.top);
        ss.width = (UINT)(rc.right - rc.left);
        MoveWindow( hwnd, ss.left,ss.top, ss.width, ss.height, 0 );
      }
      break;
    } 
    case WM_ERASEBKGND:
    {
      if (ss.sstype == -1)
        return 1;
      break;
    }
    case WM_PAINT:
    {
      if (ss.sstype == 0)
      {
        PAINTSTRUCT ps;
        BeginPaint(hwnd, &ps);
        EndPaint(hwnd,&ps);
        return 0;
      }
      if (ss.sstype == -1) /* transparent */
      {
        PAINTSTRUCT ps;
        HDC hDC = BeginPaint(hwnd, &ps);
        if (hDC)
        {
          HWND hDesktop = GetDesktopWindow();
          HDC hDesktopDC = GetDC(hDesktop);
          SetBkMode(hDC, TRANSPARENT);
          if (hDesktopDC)
          {
            if (ss.hParentWnd) /* preview mode + transparent */
            {
              UINT oldbltmode = STRETCH_ORSCANS;
              #if defined(STRETCH_HALFTONE)
              oldbltmode = STRETCH_HALFTONE;
              #endif
              oldbltmode = SetStretchBltMode( hDC, oldbltmode );
              #if defined(STRETCH_HALFTONE)
              SetBrushOrgEx(hDC, 0, 0, NULL);
              #endif
              StretchBlt(hDC, 0, 0, ss.width, ss.height, 
                         hDesktopDC, 0, 0, 
                         GetSystemMetrics(SM_CXSCREEN),
                         GetSystemMetrics(SM_CYSCREEN),
                         SRCCOPY);
              SetStretchBltMode( hDC, oldbltmode );
            }
            else /* fullscreen mode + transparent */
            {
              BitBlt(hDC, 0, 0, ss.width, ss.height, 
                hDesktopDC, 0, 0, SRCCOPY);
            }
            ReleaseDC( hDesktop, hDesktopDC );
          }
        }
        EndPaint(hwnd,&ps);
      }
      break;
    }
    #if 0 /* can't use this otherwise broadcast messages will destroy us */
    case WM_ACTIVATE: 
    case WM_ACTIVATEAPP: 
    case WM_NCACTIVATE:
    { 
      if (LOWORD(wParam)==WA_INACTIVE && !ss.hParentWnd && !ss.isDialogActive)
      {
        ss.reallyClose = 1;
        PostMessage(hwnd,WM_CLOSE,0,0);
      }
      break;
    }
    #endif
    case WM_SETCURSOR:
    { 
      if (ss.hParentWnd==NULL && !ss.isDialogActive && ss.sstype != -1)
        SetCursor(NULL);
      else
        SetCursor(LoadCursor(NULL,IDC_ARROW));
      break;
    }
    case WM_LBUTTONDOWN: 
    case WM_MBUTTONDOWN: 
    case WM_RBUTTONDOWN: 
    case WM_KEYDOWN:
    { 
      if (ss.hParentWnd==NULL && !ss.isDialogActive)
      {
        ss.reallyClose = 1;
        PostMessage(hwnd,WM_CLOSE,0,0);
      }  
      break;
    }
    case WM_MOUSEMOVE:
    { 
      if (ss.hParentWnd==NULL && !ss.isDialogActive)
      {
        POINT pt; int dx, dy;
        GetCursorPos(&pt); 
        dx= pt.x - ss.initCursorPos.x; if (dx<0) dx=-dx; 
        dy= pt.y - ss.initCursorPos.y; if (dy<0) dy=-dy;
        if (dy > ss.mmthreshY || dx > ss.mmthreshX)
        {
          ss.reallyClose = 1;
          PostMessage(hwnd,WM_CLOSE,0,0);
        }  
        else /* adjust for a mouse on an uneven surface */
        {
          ss.initCursorPos.x = pt.x;
          ss.initCursorPos.y = pt.y;
        }
      }
      break;
    }
    case WM_SYSCOMMAND:
    { 
      if (ss.hParentWnd==NULL && (wParam==SC_SCREENSAVE || wParam==SC_CLOSE))
        return 0;
      break;
    }
    case (WM_CLOSE):
    { 
      if (ss.hParentWnd==NULL) 
      {
        if (ss.reallyClose && !ss.isDialogActive)
        {
          BOOL canClose = TRUE;
          #if (CLIENT_OS == OS_WIN32)
          /*transparent has no password, and NT manages passwords by itself*/
          if (ss.sstype!=-1 && winGetVersion()>=400 && winGetVersion()<2000)
          {
            /* we skip the password dialog if we have barely started */
            canClose = ((GetTickCount() - ss.initTime) < (1000*5));
          }
          if (!canClose)
          {
            HINSTANCE hpwdcpl = LoadLibrary("PASSWORD.CPL");
            canClose = TRUE;
            if (hpwdcpl != NULL) 
            {
              typedef BOOL (WINAPI *VERIFYSCREENSAVEPWD)(HWND hwnd);
              VERIFYSCREENSAVEPWD VerifyScreenSavePwd;
              VerifyScreenSavePwd = (VERIFYSCREENSAVEPWD)
                       GetProcAddress(hpwdcpl,"VerifyScreenSavePwd");
              if (VerifyScreenSavePwd)
              {
                ss.isDialogActive = 1; 
                SendMessage( hwnd, WM_SETCURSOR, 0, 0 );
                canClose = VerifyScreenSavePwd(hwnd);
                ss.isDialogActive = 0; 
                SendMessage( hwnd, WM_SETCURSOR, 0, 0 );
              }
              FreeLibrary( hpwdcpl );
            }
          }
          #endif
          if (canClose)
            DestroyWindow(hwnd);
        }
        return 0;
      }  
      break;
    }
    case WM_DESTROY:
    {
      SetCursor(LoadCursor(NULL,IDC_ARROW));
      PostQuitMessage(0);
      break;
    }
  }
  return DefWindowProc(hwnd,msg,wParam,lParam);
}

/* ---------------------------------------------------- */

#pragma pack(1)
struct _ifh /* size 20 */
 {
   WORD    Machine;                /* 0 */
   WORD    NumberOfSections;       /* 2 */
   DWORD   TimeDateStamp;          /* 4 */
   DWORD   PointerToSymbolTable;   /* 8 */
   DWORD   NumberOfSymbols;        /* 12 */
   WORD    SizeOfOptionalHeader;   /* 16 */
   WORD    Characteristics;        /* 18 */
};
struct _ofh /* size 224 */
{
   WORD    Magic;                  /*  0 */
   BYTE    MajorLinkerVersion;     /*  2 */
   BYTE    MinorLinkerVersion;     /*  3 */
   DWORD   SizeOfCode;             /*  4 */
   DWORD   SizeOfInitializedData;  /*  8 */
   DWORD   SizeOfUninitializedData;/* 12 */
   DWORD   AddressOfEntryPoint;    /* 16 */
   DWORD   BaseOfCode;             /* 20 */
   DWORD   BaseOfData;             /* 24 */
   DWORD   ImageBase;              /* 28 */
   /* --- end of std header, begin NT specific part */
   DWORD   SectionAlignment;       /* 32 */
   DWORD   FileAlignment;          /* 36 */
   WORD    MajorOSVersion;         /* 40 */
   WORD    MinorOSVersion;         /* 42 */
   WORD    MajorImageVersion;      /* 44 */
   WORD    MinorImageVersion;      /* 46 */
   WORD    MajorSubsystemVersion;  /* 48 */
   WORD    MinorSubsystemVersion;  /* 50 */
   DWORD   Win32VersionValue;      /* 52 always 0? */
   DWORD   SizeOfImage;            /* 56 */
   DWORD   SizeOfHeaders;          /* 60 */
   DWORD   CheckSum;               /* 64 */
   WORD    Subsystem;              /* 68 */
   WORD    DllCharacteristics;     /* 70 */
   DWORD   SizeOfStackReserve;     /* 72 */
   DWORD   SizeOfStackCommit;      /* 76 */
   DWORD   SizeOfHeapReserve;      /* 80 */
   DWORD   SizeOfHeapCommit;       /* 84 */
   DWORD   LoaderFlags;            /* 88 */
   DWORD   NumberOfRvaAndSizes;    /* 92 */
   struct { DWORD VirtualAddress, Size; } DataDirectory[16]; /* 96-224 */
   //IMAGE_DATA_DIRECTORY DataDirectory[IMAGE_NUMBEROF_DIRECTORY_ENTRIES];
};
/* first section begins here */
struct _ish /* size 40 */
{
  BYTE    Name[8];
  union 
  { DWORD   PhysicalAddress;
    DWORD   VirtualSize;
  } Misc;
  DWORD   VirtualAddress;
  DWORD   SizeOfRawData;
  DWORD   PointerToRawData;
  DWORD   PointerToRelocations;
  DWORD   PointerToLinenumbers;
  WORD    NumberOfRelocations;
  WORD    NumberOfLinenumbers;
  DWORD   Characteristics;
};
/* end of fixed headers */
struct _irde 
{
  union __dummy1 {
    struct __dummy2 
    { DWORD NameOffset:31;
      DWORD NameIsString:1;
    };
    DWORD  Name;
    WORD  Id;
  };
  union __dummy3 {
    DWORD   OffsetToData;
    struct __dummy4 {
      DWORD   OffsetToDirectory:31;
      DWORD   DataIsDirectory:1;
    };
  };
};
struct _ird
{
  DWORD   Characteristics;
  DWORD   TimeDateStamp;
